<script lang="ts">
	let year = new Date().getFullYear() + 543;
	import Heading from '$lib/components/Heading.svelte';
	import P from '$lib/components/P.svelte';
	import SellerCard from '$lib/components/SellerCard.svelte';
	import SellerMoreCard from '$lib/components/SellerMoreCard.svelte';
	import { Bar } from 'svelte-chartjs';
	import Chart from 'chart.js/auto';
	import HowTo from './howto/+page.svelte';
	import About from './about/+page.svelte';

	interface SellerData {
		image: string;
		name: string;
		address: string;
		phone: string;
		price: number;
		id: number;
	}
	let rawdata = `
เม.ย. 2542	27.6425
พ.ค. 2542	26.9145
มิ.ย. 2542	26.2065
ก.ค. 2542	25.5185
ส.ค. 2542	24.8505
ก.ย. 2542	24.2025
เม.ย. 2543	23.5745
พ.ค. 2543	22.9665
มิ.ย. 2543	22.3785
ก.ค. 2543	21.8105
ส.ค. 2543	21.2625
ก.ย. 2543	20.7345
เม.ย. 2544	20.2265
พ.ค. 2544	19.7385
มิ.ย. 2544	19.2705
ก.ค. 2544	18.8225
ส.ค. 2544	18.3945
ก.ย. 2544	17.9865
เม.ย. 2545	17.5985
พ.ค. 2545	17.2305
มิ.ย. 2545	16.8825
ก.ค. 2545	16.5545
ส.ค. 2545	16.2465
ก.ย. 2545	15.9585
เม.ย. 2546	15.6905
พ.ค. 2546	15.4425
มิ.ย. 2546	15.2145
ก.ค. 2546	15.0065
ส.ค. 2546	14.8185
ก.ย. 2546	14.6505
เม.ย. 2547	14.5025
พ.ค. 2547	14.3745
มิ.ย. 2547	14.2665
ก.ค. 2547	14.1785
ส.ค. 2547	14.1105
ก.ย. 2547	14.0625
เม.ย. 2548	14.0345
พ.ค. 2548	14.0265
มิ.ย. 2548	14.0385
ก.ค. 2548	14.0705
ส.ค. 2548	14.1225
ก.ย. 2548	14.1945
เม.ย. 2549	14.2865
พ.ค. 2549	14.3985
มิ.ย. 2549	14.5305
ก.ค. 2549	14.6825
ส.ค. 2549	14.8545
ก.ย. 2549	15.0465
เม.ย. 2550	15.2585
พ.ค. 2550	15.4905
มิ.ย. 2550	15.7425
ก.ค. 2550	16.0145
ส.ค. 2550	16.3065
ก.ย. 2550	16.6185
เม.ย. 2551	16.9505
พ.ค. 2551	17.3025
มิ.ย. 2551	17.6745
ก.ค. 2551	18.0665
ส.ค. 2551	18.4785
ก.ย. 2551	18.9105
เม.ย. 2552	19.3625
พ.ค. 2552	19.8345
มิ.ย. 2552	20.3265
ก.ค. 2552	20.8385
ส.ค. 2552	21.3705
ก.ย. 2552	21.9225
เม.ย. 2553	22.4945
พ.ค. 2553	23.0865
มิ.ย. 2553	23.6985
ก.ค. 2553	24.3305
ส.ค. 2553	24.9825
ก.ย. 2553	25.6545
เม.ย. 2554	26.3465
พ.ค. 2554	27.0585
มิ.ย. 2554	27.7905
ก.ค. 2554	28.5425
ส.ค. 2554	29.3145
ก.ย. 2554	30.1065
เม.ย. 2555	30.9185
พ.ค. 2555	31.7505
มิ.ย. 2555	32.6025
ก.ค. 2555	33.4745
ส.ค. 2555	34.3665
ก.ย. 2555	35.2785
เม.ย. 2556	36.2105
พ.ค. 2556	37.1625
มิ.ย. 2556	38.1345
ก.ค. 2556	39.1265
ส.ค. 2556	40.1385
ก.ย. 2556	41.1705
เม.ย. 2557	42.2225
พ.ค. 2557	43.2945
มิ.ย. 2557	44.3865
ก.ค. 2557	45.4985
ส.ค. 2557	46.6305
ก.ย. 2557	47.7825
เม.ย. 2558	48.9545
พ.ค. 2558	50.1465
มิ.ย. 2558	51.3585
ก.ค. 2558	52.5905
ส.ค. 2558	53.8425
ก.ย. 2558	55.1145
เม.ย. 2559	56.4065
พ.ค. 2559	57.7185
มิ.ย. 2559	59.0505
ก.ค. 2559	60.4025
ส.ค. 2559	61.7745
ก.ย. 2559	63.1665
เม.ย. 2560	64.5785
พ.ค. 2560	66.0105
มิ.ย. 2560	67.4625
ก.ค. 2560	68.9345
ส.ค. 2560	70.4265
ก.ย. 2560	71.9385
เม.ย. 2561	73.4705
พ.ค. 2561	75.0225
มิ.ย. 2561	76.5945
ก.ค. 2561	78.1865
ส.ค. 2561	79.7985
ก.ย. 2561	81.4305
เม.ย. 2562	83.0825
พ.ค. 2562	84.7545
มิ.ย. 2562	86.4465
ก.ค. 2562	88.1585
ส.ค. 2562	89.8905
ก.ย. 2562	91.6425
เม.ย. 2563	93.4145
พ.ค. 2563	95.2065
มิ.ย. 2563	97.0185
ก.ค. 2563	98.8505
ส.ค. 2563	100.7025
ก.ย. 2563	102.5745
เม.ย. 2564	104.4665
พ.ค. 2564	106.3785
มิ.ย. 2564	108.3105
ก.ค. 2564	110.2625
ส.ค. 2564	112.2345
ก.ย. 2564	114.2265
เม.ย. 2565	116.2385
พ.ค. 2565	118.2705
มิ.ย. 2565	120.3225
ก.ค. 2565	122.3945
ส.ค. 2565	124.4865
ก.ย. 2565	126.5985
เม.ย. 2566	128.7305
พ.ค. 2566	130.8825
มิ.ย. 2566	133.0545
ก.ค. 2566	135.2465
ส.ค. 2566	137.4585
ก.ย. 2566	139.6905
เม.ย. 2567	141.9425
พ.ค. 2567	144.2145
มิ.ย. 2567	146.5065
ก.ค. 2567	148.8185
ส.ค. 2567	151.1505
ก.ย. 2567	153.5025
`
		.split('\n')
		.map((e) => e.split('\t'));

	const data: SellerData[] = [
		{
			name: 'ทดสอบ นางสอบทด',
			address: 'อ.สตึก, บุรีรัมย์',
			phone: '0812345678',
			price: 152,
			image:
				'https://images.unsplash.com/photo-1637819743321-d06e11ac213a?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1026&q=80',
			id: 1
		},
		{
			name: 'ทดสอบ นางสอบทด 2',
			address: 'อ.แคนดง, บุรีรัมย์',
			phone: '0812345678',
			price: 155,
			image:
				'https://images.unsplash.com/photo-1637819743321-d06e11ac213a?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1026&q=80',
			id: 2
		}
	];

	let chartData = {
		labels: rawdata.map((d) => d[0]),
		datasets: [
			{
				label: 'ราคาพยากรณ์',
				type: 'line',
				backgroundColor: 'rgb(108, 43, 217)',
				hoverBorderColor: 'white',
				fill: false,
				tension: 0,
				data: rawdata.map((d) => d[1]),
				yAxisID: 'y',
				xAxisID: 'x'
			}
		]
	};
	let chartOptions = {
		scales: {
			xAxes: [
				{
					id: 'x',
					type: 'category'
				}
			],
			yAxes: [
				{
					id: 'y',
					type: 'linear',
					position: 'left',
					ticks: {
						stepSize: 1
					}
				}
			]
		}
	};
</script>

<svelte:head>
	<title>หน้าหลัก</title>
</svelte:head>

<section class="my-4">
	<About />
</section>
<section class="first-section">
	<!-- <Heading tag="h1">กราฟพยากรณ์ราคาทุเรียนปี {year}</Heading>
	<div class="z-0 my-10">
		<Bar data={chartData} options={chartOptions} />
	</div>
	<Heading tag="h2" customSize="text-2xl text-bold mt-4">รายละเอียดกราฟ</Heading>
	<P class="font-loop"
		>รันเวย์คอนโดยะเยือก อัลมอนด์ สเตชั่นสตริงแจ๊กพอตดีพาร์ตเมนท์ บิ๊ก คาร์โก้
		ซีนเซนเซอร์โยเกิร์ตฮองเฮาพาร์ตเนอร์ รีเสิร์ชปัจเจกชนไมเกรน ศิลปากรเทรดจึ๊กสเตเดียม ซูม
		พ่อค้าอีสเตอร์ ตรวจสอบนายพรานแชมปิยอง รีโมตคอลัมนิสต์ซูฮกเชอร์รี่
		ไอซียูท็อปบูตคลาสสิกหม่านโถวง่าว ซูฮกเกสต์เฮาส์บอร์ดสแล็ก แพ็คตนเองโอเปร่าเจได เพนกวิน</P
	> -->
</section>
<!-- <section>
	<Heading tag="h2" customSize="text-2xl text-bold mt-4">ร้านค้าทุเรียน</Heading>
	<div
		class="flex flex-wrap justify-center overflow-auto
		md:gap-x-2 md:w-auto md:block md:whitespace-nowrap md:snap-mandatory md:snap-x"
	>
		{#each data as { name, address, phone, price, image, id }}
			<SellerCard {name} {address} {phone} {price} {image} {id} />
		{/each}
		<SellerMoreCard />
	</div>
</section> -->
<section class="my-4">
	<HowTo />
</section>

<style>
	.first-section {
		height: calc(100wh - 84px);
	}
</style>
